Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxGtm_PinMap_TC38x_LFBGA516.c
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1N_TOUT260_P14_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_i, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1N_TOUT268_P10_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 268, {&MODULE_P10,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT120_P11_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 120, {&MODULE_P11, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT131_P22_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_k, 131, {&MODULE_P22, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT147_P34_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_k, 147, {&MODULE_P34, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT156_P01_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT164_P01_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_i, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT175_P31_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 175, {&MODULE_P31, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT207_P25_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 207, {&MODULE_P25, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT242_P15_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT253_P13_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_i, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_1_TOUT265_P10_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 265, {&MODULE_P10, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT124_P11_8_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 124, {&MODULE_P11, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT136_P22_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_l, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT141_P32_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT159_P01_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT179_P31_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 179, {&MODULE_P31, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT211_P25_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 211, {&MODULE_P25, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT246_P15_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT250_P13_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT259_P14_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2N_TOUT269_P10_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 269, {&MODULE_P10,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT121_P11_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 121, {&MODULE_P11, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT132_P22_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 132, {&MODULE_P22, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT148_P34_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 148, {&MODULE_P34, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT152_P02_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT157_P01_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT176_P31_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT208_P25_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT243_P15_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT254_P13_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_i, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_2_TOUT266_P10_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 266, {&MODULE_P10,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT123_P11_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 123, {&MODULE_P11, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT125_P11_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 125, {&MODULE_P11,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT137_P22_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_l, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT142_P32_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT160_P01_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT180_P31_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT212_P25_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT212_P26_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT247_P15_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT249_P13_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT263_P14_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3N_TOUT270_P10_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT122_P11_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 122, {&MODULE_P11, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT133_P22_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 133, {&MODULE_P22, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT149_P34_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 149, {&MODULE_P34, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT163_P01_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT165_P01_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT177_P31_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 177, {&MODULE_P31, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT209_P25_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 209, {&MODULE_P25, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT244_P15_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT255_P13_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_i, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_3_TOUT267_P10_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT122_P11_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 122, {&MODULE_P11, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT129_P12_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 129, {&MODULE_P12, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT163_P01_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT165_P01_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT177_P31_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 177, {&MODULE_P31, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT209_P25_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 209, {&MODULE_P25, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4N_TOUT267_P10_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_j, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT123_P11_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 123, {&MODULE_P11, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT134_P22_8_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 134, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT150_P34_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 150, {&MODULE_P34, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT158_P01_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT178_P31_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 178, {&MODULE_P31, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT210_P25_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 210, {&MODULE_P25, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT245_P15_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT248_P13_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_4_TOUT268_P10_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 268, {&MODULE_P10,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5N_TOUT119_P11_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_i, 119, {&MODULE_P11, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5N_TOUT155_P01_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_i, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5N_TOUT162_P01_8_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_k, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5N_TOUT174_P31_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_k, 174, {&MODULE_P31, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5N_TOUT206_P25_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_k, 206, {&MODULE_P25, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT124_P11_8_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 124, {&MODULE_P11, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT135_P22_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_k, 135, {&MODULE_P22, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT140_P32_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT159_P01_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT179_P31_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 179, {&MODULE_P31, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT211_P25_5_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 211, {&MODULE_P25, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT246_P15_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT250_P13_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_i, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_5_TOUT269_P10_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 269, {&MODULE_P10,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT120_P11_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_i, 120, {&MODULE_P11, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT156_P01_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_i, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT158_P01_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT175_P31_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 175, {&MODULE_P31, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT207_P25_1_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 207, {&MODULE_P25, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6N_TOUT96_P11_3_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 96, {&MODULE_P11, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT125_P11_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 125, {&MODULE_P11,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT136_P22_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT141_P32_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT160_P01_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT180_P31_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT212_P25_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT212_P26_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT247_P15_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT249_P13_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_i, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT270_P10_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT121_P11_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 121, {&MODULE_P11, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT152_P02_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT157_P01_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT176_P31_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT208_P25_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT126_P11_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 126, {&MODULE_P11,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT137_P22_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT142_P32_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT181_P31_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 181, {&MODULE_P31, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT213_P25_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 213, {&MODULE_P25, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT248_P13_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT127_P11_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 127, {&MODULE_P11,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT141_P32_6_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT155_P01_0_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT162_P01_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT182_P31_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 182, {&MODULE_P31, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT214_P25_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 214, {&MODULE_P25, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT242_P15_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_i, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT250_P13_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT128_P12_0_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 128, {&MODULE_P12, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT142_P32_7_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT156_P01_2_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT164_P01_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT183_P31_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 183, {&MODULE_P31, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT215_P25_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 215, {&MODULE_P25, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT251_P13_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT258_P14_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT129_P12_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 129, {&MODULE_P12, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT143_P33_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 143, {&MODULE_P33,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT152_P02_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT157_P01_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT184_P31_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 184, {&MODULE_P31,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT216_P25_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 216, {&MODULE_P25,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT252_P13_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT259_P14_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT111_P01_3_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 111, {&MODULE_P01, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT144_P33_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 144, {&MODULE_P33,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT163_P01_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT165_P01_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT185_P31_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 185, {&MODULE_P31,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT217_P25_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 217, {&MODULE_P25,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT253_P13_4_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT260_P14_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT140_P32_5_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT143_P33_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 143, {&MODULE_P33,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT158_P01_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT186_P31_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT218_P25_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT254_P13_5_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT261_P14_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT31_P33_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 31, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT146_P34_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 146, {&MODULE_P34, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT159_P01_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
