Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxGtm_PinMap_TC38x_LFBGA516.c
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT187_P31_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT219_P25_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT243_P15_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_i, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT255_P13_6_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT262_P13_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 262, {&MODULE_P13,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT147_P34_2_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 147, {&MODULE_P34, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT160_P01_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT188_P31_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 188, {&MODULE_P31,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT220_P25_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 220, {&MODULE_P25,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT256_P13_7_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT263_P14_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT148_P34_3_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 148, {&MODULE_P34, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT189_P31_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 189, {&MODULE_P31,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT221_P25_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 221, {&MODULE_P25,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT244_P15_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT264_P13_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT149_P34_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 149, {&MODULE_P34, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT162_P01_8_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT190_P30_0_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 190, {&MODULE_P30, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT222_P24_0_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 222, {&MODULE_P24, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT249_P13_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT258_P14_11_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT150_P34_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 150, {&MODULE_P34, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT163_P01_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT191_P30_1_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 191, {&MODULE_P30, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT223_P24_1_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 223, {&MODULE_P24, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT242_P15_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT245_P15_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT253_P13_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT265_P10_9_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 265, {&MODULE_P10, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT164_P01_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT192_P30_2_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 192, {&MODULE_P30, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT224_P24_2_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 224, {&MODULE_P24, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT243_P15_11_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT246_P15_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT254_P13_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT266_P10_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 266, {&MODULE_P10,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT166_P00_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 166, {&MODULE_P00,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT193_P30_3_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT225_P24_3_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT244_P15_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT247_P15_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT255_P13_6_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT267_P10_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT167_P00_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 167, {&MODULE_P00,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT194_P30_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 194, {&MODULE_P30, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT226_P24_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 226, {&MODULE_P24, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT245_P15_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT248_P13_9_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_j, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT268_P10_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 268, {&MODULE_P10,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT168_P00_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 168, {&MODULE_P00,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT195_P30_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 195, {&MODULE_P30, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT227_P24_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 227, {&MODULE_P24, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT246_P15_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT251_P13_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_5_TOUT269_P10_11_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 269, {&MODULE_P10,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT151_P02_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT153_P02_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 153, {&MODULE_P02,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT196_P30_6_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 196, {&MODULE_P30, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT228_P24_6_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 228, {&MODULE_P24, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT247_P15_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT249_P13_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_6_TOUT270_P10_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT152_P02_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT154_P02_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 154, {&MODULE_P02,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT197_P30_7_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 197, {&MODULE_P30, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT229_P24_7_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 229, {&MODULE_P24, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT248_P13_9_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_7_TOUT261_P14_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_0_TOUT162_P01_8_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_0_TOUT198_P30_8_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 198, {&MODULE_P30, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_0_TOUT230_P24_8_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_0_TOUT242_P15_10_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_0_TOUT250_P13_11_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_1_TOUT163_P01_10_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_1_TOUT199_P30_9_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 199, {&MODULE_P30, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_1_TOUT231_P24_9_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_1_TOUT251_P13_10_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_1_TOUT258_P14_11_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_2_TOUT164_P01_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_2_TOUT200_P30_10_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 200, {&MODULE_P30,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_2_TOUT232_P24_10_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 232, {&MODULE_P24,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_2_TOUT252_P13_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_2_TOUT259_P14_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_3_TOUT166_P00_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 166, {&MODULE_P00,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_3_TOUT201_P30_11_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 201, {&MODULE_P30,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_3_TOUT233_P24_11_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 233, {&MODULE_P24,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_3_TOUT253_P13_4_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_3_TOUT260_P14_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_4_TOUT167_P00_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 167, {&MODULE_P00,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_4_TOUT202_P30_12_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_4_TOUT234_P24_12_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 234, {&MODULE_P24,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_4_TOUT254_P13_5_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_4_TOUT261_P14_12_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT168_P00_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 168, {&MODULE_P00,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT203_P30_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT235_P24_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 235, {&MODULE_P24,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT243_P15_11_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT255_P13_6_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_5_TOUT262_P13_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 262, {&MODULE_P13,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT151_P02_12_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT153_P02_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 153, {&MODULE_P02,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT204_P30_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 204, {&MODULE_P30,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT236_P24_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 236, {&MODULE_P24,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT256_P13_7_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_6_TOUT263_P14_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT152_P02_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT154_P02_14_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 154, {&MODULE_P02,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_l, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT205_P30_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 205, {&MODULE_P30,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT237_P24_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 237, {&MODULE_P24,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT244_P15_12_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM8_7_TOUT264_P13_15_OUT = {IfxGtm_Atom_8, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Clk_Out IfxGtm_CLK0_P23_1_OUT = {&MODULE_GTM, {&MODULE_P23, 1}, IfxPort_OutputIdx_alt4};
IfxGtm_Clk_Out IfxGtm_CLK1_P32_4_OUT = {&MODULE_GTM, {&MODULE_P32, 4}, IfxPort_OutputIdx_alt4};
IfxGtm_Clk_Out IfxGtm_CLK2_P11_12_OUT = {&MODULE_GTM, {&MODULE_P11,12}, IfxPort_OutputIdx_alt3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P00_9_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P00, 9}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P02_0_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P02, 0}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P10_7_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P10, 7}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P13_12_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P13,12}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P14_5_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P14, 5}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P14_7_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P14, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P15_6_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P15, 6}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P21_2_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P21, 2}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P22_1_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P22, 1}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P33_10_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P33,10}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM0_0_P33_4_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_0, {&MODULE_P33, 4}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P00_10_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P00,10}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P02_1_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P02, 1}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P10_1_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P10, 1}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P10_9_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P10, 9}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P14_6_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P14, 6}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P15_7_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P15, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P21_3_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P21, 3}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P22_0_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P22, 0}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P33_5_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P33, 5}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM0_1_P33_9_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_1, {&MODULE_P33, 9}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P00_11_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P00,11}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P02_2_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P02, 2}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P02_9_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P02, 9}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P10_10_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P10,10}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P10_2_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P10, 2}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P10_5_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P10, 5}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P15_8_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P15, 8}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P21_4_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P21, 4}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P23_5_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P23, 5}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P33_11_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P33,11}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM0_2_P33_6_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_2, {&MODULE_P33, 6}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P00_12_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P00,12}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P02_10_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P02,10}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P02_3_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P02, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P10_14_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P10,14}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P10_3_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P10, 3}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P10_6_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P10, 6}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P14_0_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P14, 0}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P21_5_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P21, 5}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P22_2_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P22, 2}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P32_2_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P32, 2}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM0_3_P33_7_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_3, {&MODULE_P33, 7}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P02_4_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P02, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P10_0_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P10, 0}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P10_13_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P10,13}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P14_1_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P14, 1}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P21_6_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P21, 6}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P22_3_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P22, 3}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P32_3_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P32, 3}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM0_4_P33_0_IN = {IfxGtm_Tim_0, IfxGtm_Tim_Ch_4, {&MODULE_P33, 0}, (IfxGtm_ChXSel)6};
